Bartchez/quad-stm32/Program/_Application/main.c
 
/* Includes ------------------------------------------------------------------*/ 
#include "stm32f10x.h" 
 
// Configurations 
#include "qdt_config.h" 
#include "core_cm3.h" 
 
// Own libraries 
#include "sd.h"
#include "gps.h" 
#include "rfm12.h" 
#include "18B20.h" 
#include "MPL115A2.h" 
#include "rfm12_controller.h" 
 
/* Private typedef -----------------------------------------------------------*/ 
/* Private define ------------------------------------------------------------*/ 
/* Private macro -------------------------------------------------------------*/ 
/* Private variables ---------------------------------------------------------*/ 
/* Private function prototypes -----------------------------------------------*/ 
void RCC_Configuration(void); 
void TIM_Configuration(void); 
void SPI_Configuration(void); 
void GPIO_Configuration(void); 
void NVIC_Configuration(void); 
void EXTI_Configuration(void); 
void USART_Configuration(void); 
void SysTick_Configuration(void); 
void I2C_Configuration(void); 
void ADC_Configuration(void); 
void DMA_Configuration(void); 
 
/* Private functions ---------------------------------------------------------*/ 
void Delay(__IO uint32_t nCount); 

// keep ADC measures
unsigned short int buforADC[8] = {0};
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
int main(void)  
{ 

volatile unsigned long int i;
	unsigned long int napiecie, temperatura;
	unsigned char Tekst[7] = {"0\0"};

	uint8_t ret = 0; 
	char test[120]; 
 
	/* NVIC Configuration */ 
	NVIC_Configuration(); 
 
	/* System Clocks Configuration */ 
	RCC_Configuration(); 
 
	/* GPIO Configuration */ 
	GPIO_Configuration(); 
 
	/* USART Configuration */ 
	USART_Configuration(); 
 
	/* SPI Configuration */ 
	SPI_Configuration(); 
 
	/* EXTI Configuration */ 
	EXTI_Configuration(); 
 
	/* TIM Configuration */ 
	TIM_Configuration(); 
 
	/* I2C Configuration */ 
	I2C_Configuration(); 

	/* DMA Configuration */
	DMA_Configuration(); 

	/* ADC Configuration */ 
	ADC_Configuration();

	/* SysTick Configuration */ 
	SysTick_Configuration(); 
 
	/* Init rfm12 module */ 
	rf12_init();   
 
	/* Init GPS sensor */ 
	gps_init(); 
 
	/* Init send/recive rfm12 controller */ 
	rf12_controller_init(); 
 
	/* Init send/recive rfm12 controller */ 
	rf12_controller_init(); 
 
	// odcekaj po konfuguracji rfm12 
	Delay(0x0fffff); 
 
	while (1)  
	{		  
 
		// blink LED 
		GPIO_ResetBits(LEDS_PORT, LED_BIT_1); //LED8 ON 
    	GPIO_SetBits(LEDS_PORT, LED_BIT_2);   //LED9 OFF 
    	Delay(0x5FFFF); 
		GPIO_SetBits(LEDS_PORT, LED_BIT_1);   //LED9 ON 
    	GPIO_ResetBits(LEDS_PORT, LED_BIT_2); //LED8 OFF 
    	Delay(0x5FFFF); 
 
#ifdef QUAD		  

		// read pressure values sensor and save to mpl115a2_pressure ivar 
		mpl115a2_read_pressure(); 

		// read temp values from 6 sensors and save to temp_measurements array 
//		ds18b20_read_temps(); 


	    /*Tu nalezy umiescic glowny kod programu*/

	    napiecie = buforADC[0] * 8059/10000;                                     //przelicz wartosc wyrazona jako calkowita, 12-bit na rzeczywista
 	  	sprintf((char *)Tekst, "%d,%03d V\0", napiecie / 1000, napiecie % 1000); //Dzielenie calkowite wyznacza wartosc w V,  dzielenie modulo - czeasc po przecinku

		printf("%s", Tekst);

   		temperatura = (1430 - buforADC[1] * 8059/10000)*10/43+25;                //przelicz wartosc wyrazona jako calkowita, 12-bit na rzeczywista, wartosci typowe wg. Datasheet, 5.3.18, str. 75.
 	  	sprintf((char *)Tekst, "%2d C\0", temperatura); 

		printf("%s \n", Tekst);


#endif 

#ifdef PILOT		  
//		sd_write_line("dane.txt", wartoscADC1VTekst, 6, 1);
#endif 
 
#ifdef PILOT		 
 
		if( !(rf12_rx || rf12_tx || rf12_new) )  rf12_rxstart(); 
 
		if( rf12_new )	{ 
 
			ret = rf12_rxfinish(test);	// sprawdY czy odebrano kompletn1 ramke 
 
			if(ret > 0 && ret < 254) {	// brak b3edów CRC - odebrana ramka 
				printf(test);		// wyolij odebrane dane do terminala PC 

				test[16]=0;				// przytnij dane do 16 znaków ASCII 
			} 
			else 
				 
			if(!ret) {					// wyst1pi3 b31d CRC lub d3ugooci ramki 
				printf("\r\n"); 
				printf("--------------------\r\n"); 
				printf("|  CRC error !!!   |\r\n"); 
				printf("--------------------\r\n"); 
				printf("\r\n"); 
			} 
		} 
#endif 
 
	}; 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void GPIO_Configuration(void)  
{ 
 
	GPIO_InitTypeDef  GPIO_InitStructure;  
 
	/* Configure all unused GPIO port pins in Analog Input mode (floating input 
     trigger OFF), this will reduce the power consumption and increase the device 
     immunity against EMI/EMC *************************************************/ 
 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; 
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	GPIO_Init(GPIOC, &GPIO_InitStructure); 
 
 
	/* GPIO for COM */ 
 
	// USART1 - TX 
    GPIO_InitStructure.GPIO_Pin = COM_BIT_TX;	          
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
    GPIO_Init(COM_PORT, &GPIO_InitStructure);		    
 
 
	// USART1 - RX 
	GPIO_InitStructure.GPIO_Pin = COM_BIT_RX;	         
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;   
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
    GPIO_Init(COM_PORT, &GPIO_InitStructure); 
 
 
	/* GPIO for LEDs */ 
 
	//LEDs 
	GPIO_InitStructure.GPIO_Pin = LED_BIT_1 | LED_BIT_2 | LED_BIT_3 | LED_BIT_4 | LED_BIT_5 | LED_BIT_6; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(LEDS_PORT, &GPIO_InitStructure);  
 
 
	/* GPIO for rfm12 */ 
 
	// SPI - CS 
	GPIO_InitStructure.GPIO_Pin = RFM12_BIT_SS; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(RFM12_PORT_SS, &GPIO_InitStructure); 
 
