Bartchez/quad-stm32/Program/_Application/main.c
	//Wlaczenie przerwania 
	EXTI_InitStructure.EXTI_LineCmd = ENABLE; 
	EXTI_Init(&EXTI_InitStructure);	 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void SPI_Configuration(void) { 
 
	SPI_InitTypeDef SPI_InitStructure;  
 
	/* SPI for rfm12 */ 
 
	// Konfiguracja SPI1 
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex; 
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master; 
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b; 
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low; 
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge; 
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft; 
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32; 
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB; 
	SPI_InitStructure.SPI_CRCPolynomial = 7; 
	SPI_Init(RFM12_SPI, &SPI_InitStructure); 
	SPI_Cmd(RFM12_SPI, ENABLE);  

#ifdef PILOT
	
	/* SPI for SD */ 

	// Konfiguracja SPI2
	SPI_InitStructure.SPI_Direction =  SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;              
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;  
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SD_SPI, &SPI_InitStructure);   
    SPI_Cmd(SD_SPI, ENABLE);
#endif
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void USART_Configuration(void) { 
	USART_InitTypeDef USART_InitStructure;  
 
 	// dlugosc slowa = 8 bitow 
	USART_InitStructure.USART_WordLength = USART_WordLength_8b; 
	// 1 bit stopu 
	USART_InitStructure.USART_StopBits = USART_StopBits_1; 
	// Brak kontroli parzystosci 
	USART_InitStructure.USART_Parity = USART_Parity_No; 
	// Kontrola przeplywu danych wylaczona 
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; 
	//Tryb pracy (Rx - odbior, Tx - nadawanie) 
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; 
 
 
	/* USART for GPS */ 
 
#ifdef QUAD 
	// reset 
	USART_DeInit(GPS_USART); 
 	// predkosc transmisji = 9600 
 	USART_InitStructure.USART_BaudRate = 9600; 
 
	// Init - USART 
	USART_Init(GPS_USART, &USART_InitStructure); 
	USART_ClearFlag(GPS_USART, USART_FLAG_TC); 
	// Wlaczenie przerwan wywolywanych przez USART2 
	USART_ITConfig(GPS_USART, USART_IT_RXNE, ENABLE); 
	// Wlaczenie USART 
	USART_Cmd(GPS_USART, ENABLE); 
#endif 
 
	/* USART for COM */ 
 
	// reset 
	USART_DeInit(COM_USART); 
 	// predkosc transmisji = 115200 
 	USART_InitStructure.USART_BaudRate = 115200; 
 
	// Init - USART 
	USART_Init(COM_USART, &USART_InitStructure);  
	USART_ClearFlag(COM_USART,USART_FLAG_TC); 
	USART_ITConfig(COM_USART, USART_IT_RXNE, ENABLE); 
	USART_ITConfig(COM_USART, USART_IT_TXE, ENABLE); 
	// Wlaczenie USART 
	USART_Cmd(COM_USART, ENABLE); 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void TIM_Configuration(void)  
{ 
 
#ifdef PILOT 
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure; 
	TIM_OCInitTypeDef  TIM_OCInitStructure; 
	 
	/* TIM configuration for PWN (needed by LCD) */ 
 
	/* Time base configuration */ 
	TIM_TimeBaseStructure.TIM_Prescaler = 0;          
	TIM_TimeBaseStructure.TIM_Period = 1439ul;	// PWM = 50kHz Hz 
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; 
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; 
 
	TIM_TimeBaseInit(PWM_TIMER, &TIM_TimeBaseStructure); 
 
	/* PWM1 Mode configuration: Channel3 */ 
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; 
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; 
	TIM_OCInitStructure.TIM_Pulse = 720ul;	// 1440 / 720 = 50% 
	TIM_OCInitStructure.TIM_OCPolarity=TIM_OCPolarity_High; 
	TIM_OC3Init(PWM_TIMER, &TIM_OCInitStructure); 
 
	TIM_OC3PreloadConfig(PWM_TIMER, TIM_OCPreload_Enable);//wlaczenie buforowania 
   
	TIM_ARRPreloadConfig(PWM_TIMER, ENABLE);//wlaczenie buforowania  
  	 
	/* TIM3 enable counter */ 
	TIM_Cmd(PWM_TIMER, ENABLE);   
#endif 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void I2C_Configuration(void)  
{ 
   
#ifdef QUAD 
 
	I2C_InitTypeDef  I2C_InitStructure; 
		 
    I2C_DeInit(PRESSURE_I2C); 
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C; 
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2; 
    I2C_InitStructure.I2C_OwnAddress1 = 0x30; 
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable; 
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit; 
    I2C_InitStructure.I2C_ClockSpeed = 100000; 
     
    I2C_Cmd(PRESSURE_I2C, ENABLE); 
    I2C_Init(PRESSURE_I2C, &I2C_InitStructure); 
 
    I2C_AcknowledgeConfig(PRESSURE_I2C, ENABLE); 
#endif 				  
} 

//////////////////////////////////////////////////////////////////////////////////////////////////// 
void DMA_Configuration(void) {
#ifdef QUAD 
	//konfigurowanie DMA

	#define ADC1_DR_Address 0x4001244C;                                             //adres rejestru ADC1->DR
  
	DMA_InitTypeDef DMA_InitStructure;
  
	DMA_DeInit(DMA1_Channel1);                                                      //Usun ewentualna poprzednia konfiguracje DMA
  
	DMA_InitStructure.DMA_PeripheralBaseAddr = (unsigned long int)ADC1_DR_Address;  //Adres docelowy transferu
	DMA_InitStructure.DMA_MemoryBaseAddr = (unsigned long int)&buforADC;            //Adres poczatku bloku do przeslania
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;                              //Kierunek transferu
	DMA_InitStructure.DMA_BufferSize = 2;                                           //Liczba elementow do przeslania (dlugosc bufora)
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;                //Wylaczenie automatycznego zwiekszania adresu po stronie ADC
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                         //Wlaczenie automatycznego zwiekszania adresu po stronie pamieci (bufora)
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;     //Rozmiar pojedynczych przesylanych danych po stronie ADC (HalfWord = 16bit)
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;             //Rozmiar pojedynczych przesylanych danych po stronie pamieci (bufora)
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;                                 //Tryb dzialania kontrolera DMA - powtarzanie cykliczne
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;                             //Priorytet DMA - wysoki
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;                                    //Wylaczenie obslugi transferu z pamieci do pamieci
	DMA_Init(DMA1_Channel1, &DMA_InitStructure);                                    //Zapis konfiguracji

	//Wlacz DMA, kanal 1
	DMA_Cmd(DMA1_Channel1, ENABLE);  
#endif
}
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void ADC_Configuration(void) {
#ifdef QUAD 
	//konfigurowanie przetwornika AC
	ADC_InitTypeDef ADC_InitStructure;
	  
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;                 			 		//Jeden przetwornik, praca niezalezna
	ADC_InitStructure.ADC_ScanConvMode = ENABLE;                        				//Pomiar dwoch kanalow, konieczne skanowanie kanalow 
  	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;                					//Pomiar w trybie ciaglym
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;					//Brak wyzwalania zewnetrznego
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;            					//Wyrownanie danych do prawej - 12 mlodszych bitow znaczacych
	ADC_InitStructure.ADC_NbrOfChannel = 8; 	                          				//Liczba uzywanych kanalow =2
	ADC_Init(ADC1, &ADC_InitStructure);                                 				//Incjalizacja przetwornika

	// Voltage - Battery 1 
	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_1_CELL_1, 1, ADC_SampleTime_1Cycles5); 
  	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_1_CELL_2, 2, ADC_SampleTime_1Cycles5); 
	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_1_CELL_3, 1, ADC_SampleTime_1Cycles5); 

	// Voltage - Battery 2 
  	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_2_CELL_1, 2, ADC_SampleTime_1Cycles5); 
	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_2_CELL_2, 1, ADC_SampleTime_1Cycles5); 
  	ADC_RegularChannelConfig(ADC1, ADC_VOLTAGE_2_CELL_3, 2, ADC_SampleTime_1Cycles5); 
	
	// Battery current (battery 1&2)
	ADC_RegularChannelConfig(ADC1, ADC_CURRENT_1, 1, ADC_SampleTime_1Cycles5); 
  	ADC_RegularChannelConfig(ADC1, ADC_CURRENT_2, 2, ADC_SampleTime_1Cycles5); 

  	ADC_DMACmd(ADC1,ENABLE);                                            				//Wlaczenie DMA dla ADC1
  	ADC_Cmd(ADC1, ENABLE);						         	            				//Wlacz ADC1

