Bartchez/quad-stm32/Program/_Application/main.c
	ADC_ResetCalibration(ADC1);	                                        				//Reset rejestrow kalibracyjnych ADC1
	while(ADC_GetResetCalibrationStatus(ADC1));	                        				//Odczekanie na wykonanie resetu

	ADC_StartCalibration(ADC1);	                                        				//Kalibracja ADC1
	while(ADC_GetCalibrationStatus(ADC1));    	                        				//Odczekanie na zakonczenie kalibracji ADC1

	ADC_SoftwareStartConvCmd(ADC1, ENABLE);                             				//rozpocznij przetwarzanie AC

#endif
}

//////////////////////////////////////////////////////////////////////////////////////////////////// 
void SysTick_Configuration(void)  
{ 
#ifdef QUAD 
 
	unsigned long int Settings; 
	unsigned long int SysTick_CLKSource = SysTick_CLKSource_HCLK_Div8; 
	unsigned long int Ticks = 9000000ul; 
 
	assert_param(IS_SYSTICK_CLK_SOURCE(SysTick_CLKSource)); 
 
	//Kontrola, czy wartosc poczatkowa nie przekracza max 
	if (Ticks > SYSTICK_MAXCOUNT)  while (1); 
 
	// Ustaw wartosc poczatkowa licznika 
	SysTick->LOAD = (Ticks & SYSTICK_MAXCOUNT) - 1; 
 
	// Ustaw priorytet przerwania 
	NVIC_SetPriority(SysTick_IRQn, 2); 
 
	// Ustaw wartosc aktualna licznika 
	SysTick->VAL = 0; 
 
	// Ustaw znaczniki wlaczenia SysTick IRQ i samego licznika 
	Settings = (1<<SYSTICK_TICKINT) | (1<<SYSTICK_ENABLE); 
 
	//Wybierz znacznik ustawien zrodla sygnalu zegarowego 
	if (SysTick_CLKSource == SysTick_CLKSource_HCLK) { 
		Settings |= SysTick_CLKSource_HCLK;  
	} else { 
		Settings &= SysTick_CLKSource_HCLK_Div8; 
	}  
 
	// Zapisz ustawienia do rejestru sterujacego SysTick (i wlacz licznik) 
	SysTick->CTRL = Settings; 
#endif 
 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void Delay(__IO uint32_t nCount) 
{ 
	for(; nCount != 0; nCount--); 
} 
